loadtest/results/20260922-115848/4-step-1500rps.txt
Running 30s test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 100 connections
  Thread calibration: mean lat.: 2470.907ms, rate sampling interval: 8269ms
  Thread calibration: mean lat.: 2692.054ms, rate sampling interval: 9068ms
  Thread calibration: mean lat.: 2690.065ms, rate sampling interval: 9003ms
  Thread calibration: mean lat.: 2696.623ms, rate sampling interval: 9101ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.87s     1.48s   11.67s    63.32%
    Req/Sec   262.00     23.55   286.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.97s 
 75.000%   10.12s 
 90.000%   10.74s 
 99.000%   11.29s 
 99.900%   11.52s 
 99.990%   11.64s 
 99.999%   11.68s 
100.000%   11.68s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5021.695     0.000000            1         1.00
    6701.055     0.100000         2118         1.11
    7614.463     0.200000         4219         1.25
    8044.543     0.300000         6336         1.43
    8527.871     0.400000         8457         1.67
    8970.239     0.500000        10546         2.00
    9199.615     0.550000        11613         2.22
    9437.183     0.600000        12649         2.50
    9682.943     0.650000        13730         2.86
    9895.935     0.700000        14769         3.33
   10117.119     0.750000        15818         4.00
   10231.807     0.775000        16376         4.44
   10330.111     0.800000        16894         5.00
   10428.415     0.825000        17391         5.71
   10534.911     0.850000        17933         6.67
   10633.215     0.875000        18442         8.00
   10682.367     0.887500        18706         8.89
   10739.711     0.900000        18988        10.00
   10797.055     0.912500        19255        11.43
   10854.399     0.925000        19523        13.33
   10911.743     0.937500        19759        16.00
   10944.511     0.943750        19888        17.78
   10985.471     0.950000        20047        20.00
   11018.239     0.956250        20159        22.86
   11059.199     0.962500        20300        26.67
   11100.159     0.968750        20423        32.00
   11124.735     0.971875        20498        35.56
   11149.311     0.975000        20566        40.00
   11173.887     0.978125        20626        45.71
   11198.463     0.981250        20690        53.33
   11223.039     0.984375        20744        64.00
   11239.423     0.985938        20778        71.11
   11255.807     0.987500        20810        80.00
   11280.383     0.989062        20856        91.43
   11296.767     0.990625        20892       106.67
   11313.151     0.992188        20914       128.00
   11329.535     0.992969        20935       142.22
   11337.727     0.993750        20945       160.00
   11354.111     0.994531        20962       182.86
   11370.495     0.995313        20981       213.33
   11378.687     0.996094        20991       256.00
   11395.071     0.996484        21001       284.44
   11411.455     0.996875        21010       320.00
   11427.839     0.997266        21020       365.71
   11444.223     0.997656        21025       426.67
   11460.607     0.998047        21033       512.00
   11468.799     0.998242        21036       568.89
   11485.183     0.998437        21044       640.00
   11493.375     0.998633        21046       731.43
   11501.567     0.998828        21049       853.33
   11517.951     0.999023        21054      1024.00
   11526.143     0.999121        21057      1137.78
   11526.143     0.999219        21057      1280.00
   11542.527     0.999316        21059      1462.86
   11550.719     0.999414        21061      1706.67
   11558.911     0.999512        21063      2048.00
   11575.295     0.999561        21065      2275.56
   11575.295     0.999609        21065      2560.00
   11583.487     0.999658        21066      2925.71
   11591.679     0.999707        21067      3413.33
   11608.063     0.999756        21070      4096.00
   11608.063     0.999780        21070      4551.11
   11608.063     0.999805        21070      5120.00
   11608.063     0.999829        21070      5851.43
   11608.063     0.999854        21070      6826.67
   11640.831     0.999878        21072      8192.00
   11640.831     0.999890        21072      9102.22
   11640.831     0.999902        21072     10240.00
   11640.831     0.999915        21072     11702.86
   11640.831     0.999927        21072     13653.33
   11640.831     0.999939        21072     16384.00
   11640.831     0.999945        21072     18204.44
   11640.831     0.999951        21072     20480.00
   11681.791     0.999957        21073     23405.71
   11681.791     1.000000        21073          inf
#[Mean    =     8865.501, StdDeviation   =     1479.460]
#[Max     =    11673.600, Total count    =        21073]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  27864 requests in 30.02s, 9.55MB read
  Non-2xx or 3xx responses: 2061
Requests/sec:    928.31
Transfer/sec:    325.82KB
------------------------------
X-Cache  HIT=25309  MISS=494  BYPASS=0  writes=0  http_errors=2061
Cache hit ratio: 98.09%
Socket errors: connect=0 read=0 write=0 timeout=0
p50     8970.24 ms
p90    10739.71 ms
p99    11288.58 ms
p99.9  11517.95 ms