loadtest/results/20260922-115848/4-step-250rps.txt
Running 30s test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 100 connections
  Thread calibration: mean lat.: 122.720ms, rate sampling interval: 346ms
  Thread calibration: mean lat.: 120.919ms, rate sampling interval: 337ms
  Thread calibration: mean lat.: 122.377ms, rate sampling interval: 352ms
  Thread calibration: mean lat.: 122.315ms, rate sampling interval: 347ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   371.71ms  265.25ms   1.31s    77.48%
    Req/Sec    62.32     40.76   216.00     65.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  276.99ms
 75.000%  526.85ms
 90.000%  761.34ms
 99.000%    1.23s 
 99.900%    1.30s 
 99.990%    1.31s 
 99.999%    1.31s 
100.000%    1.31s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      79.359     0.000000            1         1.00
     119.935     0.100000          500         1.11
     149.631     0.200000         1005         1.25
     176.895     0.300000         1501         1.43
     216.703     0.400000         2000         1.67
     276.991     0.500000         2500         2.00
     315.135     0.550000         2751         2.22
     354.047     0.600000         3001         2.50
     414.975     0.650000         3251         2.86
     464.383     0.700000         3500         3.33
     526.847     0.750000         3750         4.00
     556.543     0.775000         3876         4.44
     596.479     0.800000         4000         5.00
     630.271     0.825000         4127         5.71
     674.815     0.850000         4251         6.67
     726.015     0.875000         4375         8.00
     744.447     0.887500         4438         8.89
     761.343     0.900000         4500        10.00
     785.919     0.912500         4566        11.43
     806.911     0.925000         4625        13.33
     834.047     0.937500         4688        16.00
     862.207     0.943750         4720        17.78
     880.127     0.950000         4754        20.00
     924.671     0.956250         4782        22.86
     986.623     0.962500         4813        26.67
    1036.287     0.968750         4845        32.00
    1046.527     0.971875         4861        35.56
    1051.647     0.975000         4877        40.00
    1072.127     0.978125         4891        45.71
    1097.727     0.981250         4909        53.33
    1102.847     0.984375         4923        64.00
    1192.959     0.985938         4931        71.11
    1207.295     0.987500         4940        80.00
    1217.535     0.989062         4946        91.43
    1232.895     0.990625         4954       106.67
    1243.135     0.992188         4961       128.00
    1251.327     0.992969         4967       142.22
    1256.447     0.993750         4969       160.00
    1262.591     0.994531         4973       182.86
    1270.783     0.995313         4977       213.33
    1275.903     0.996094         4981       256.00
    1279.999     0.996484         4983       284.44
    1286.143     0.996875         4986       320.00
    1287.167     0.997266         4987       365.71
    1291.263     0.997656         4989       426.67
    1294.335     0.998047         4991       512.00
    1295.359     0.998242         4992       568.89
    1296.383     0.998437         4993       640.00
    1297.407     0.998633         4994       731.43
    1300.479     0.998828         4996       853.33
    1300.479     0.999023         4996      1024.00
    1300.479     0.999121         4996      1137.78
    1301.503     0.999219         4997      1280.00
    1301.503     0.999316         4997      1462.86
    1306.623     0.999414         4998      1706.67
    1306.623     0.999512         4998      2048.00
    1306.623     0.999561         4998      2275.56
    1307.647     0.999609         5000      2560.00
    1307.647     1.000000         5000          inf
#[Mean    =      371.714, StdDeviation   =      265.253]
#[Max     =     1306.624, Total count    =         5000]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7450 requests in 30.14s, 2.55MB read
  Non-2xx or 3xx responses: 599
Requests/sec:    247.20
Transfer/sec:     86.63KB
------------------------------
X-Cache  HIT=6405  MISS=446  BYPASS=0  writes=0  http_errors=599
Cache hit ratio: 93.49%
Socket errors: connect=0 read=0 write=0 timeout=0
p50      276.99 ms
p90      761.34 ms
p99     1227.78 ms
p99.9   1300.48 ms