loadtest/results/20260922-115848/4-step-500rps.txt
Running 30s test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 100 connections
  Thread calibration: mean lat.: 253.741ms, rate sampling interval: 1012ms
  Thread calibration: mean lat.: 239.138ms, rate sampling interval: 976ms
  Thread calibration: mean lat.: 247.524ms, rate sampling interval: 1003ms
  Thread calibration: mean lat.: 251.118ms, rate sampling interval: 1040ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   119.23ms   76.97ms 742.91ms   87.73%
    Req/Sec   125.32      5.54   145.00     87.01%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   87.49ms
 75.000%  104.13ms
 90.000%  220.93ms
 99.000%  442.88ms
 99.900%  596.48ms
 99.990%  737.28ms
 99.999%  743.42ms
100.000%  743.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      73.663     0.000000            1         1.00
      80.255     0.100000         1002         1.11
      82.239     0.200000         2020         1.25
      83.839     0.300000         3029         1.43
      85.439     0.400000         4016         1.67
      87.487     0.500000         5006         2.00
      88.767     0.550000         5516         2.22
      90.367     0.600000         6011         2.50
      92.735     0.650000         6508         2.86
      96.383     0.700000         7006         3.33
     104.127     0.750000         7506         4.00
     113.535     0.775000         7756         4.44
     129.215     0.800000         8006         5.00
     147.583     0.825000         8257         5.71
     171.903     0.850000         8508         6.67
     194.175     0.875000         8761         8.00
     207.103     0.887500         8882         8.89
     221.055     0.900000         9007        10.00
     236.927     0.912500         9134        11.43
     252.415     0.925000         9258        13.33
     268.799     0.937500         9382        16.00
     278.783     0.943750         9447        17.78
     287.231     0.950000         9508        20.00
     300.543     0.956250         9570        22.86
     320.511     0.962500         9632        26.67
     341.503     0.968750         9695        32.00
     352.255     0.971875         9726        35.56
     361.471     0.975000         9757        40.00
     376.831     0.978125         9789        45.71
     388.095     0.981250         9820        53.33
     406.527     0.984375         9851        64.00
     414.463     0.985938         9867        71.11
     422.143     0.987500         9883        80.00
     435.455     0.989062         9898        91.43
     446.207     0.990625         9915       106.67
     455.679     0.992188         9929       128.00
     468.223     0.992969         9938       142.22
     474.879     0.993750         9945       160.00
     486.143     0.994531         9954       182.86
     499.967     0.995313         9961       213.33
     514.047     0.996094         9968       256.00
     525.823     0.996484         9972       284.44
     539.135     0.996875         9976       320.00
     557.055     0.997266         9980       365.71
     563.711     0.997656         9984       426.67
     573.439     0.998047         9988       512.00
     577.023     0.998242         9990       568.89
     578.559     0.998437         9992       640.00
     585.215     0.998633         9994       731.43
     592.383     0.998828         9996       853.33
     608.255     0.999023         9998      1024.00
     621.055     0.999121         9999      1137.78
     641.535     0.999219        10001      1280.00
     641.535     0.999316        10001      1462.86
     646.143     0.999414        10002      1706.67
     648.191     0.999512        10003      2048.00
     648.191     0.999561        10003      2275.56
     662.015     0.999609        10004      2560.00
     662.015     0.999658        10004      2925.71
     668.671     0.999707        10005      3413.33
     668.671     0.999756        10005      4096.00
     668.671     0.999780        10005      4551.11
     737.279     0.999805        10006      5120.00
     737.279     0.999829        10006      5851.43
     737.279     0.999854        10006      6826.67
     737.279     0.999878        10006      8192.00
     737.279     0.999890        10006      9102.22
     743.423     0.999902        10007     10240.00
     743.423     1.000000        10007          inf
#[Mean    =      119.231, StdDeviation   =       76.974]
#[Max     =      742.912, Total count    =        10007]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14992 requests in 30.01s, 5.15MB read
  Non-2xx or 3xx responses: 967
Requests/sec:    499.65
Transfer/sec:    175.81KB
------------------------------
X-Cache  HIT=13460  MISS=565  BYPASS=0  writes=0  http_errors=967
Cache hit ratio: 95.97%
Socket errors: connect=0 read=0 write=0 timeout=0
p50       87.49 ms
p90      220.93 ms
p99      442.88 ms
p99.9    596.48 ms